88markus88/ESP32_Anchor_Alarm/src/ePaperAnchorAlarm.cpp
// write message as single bytes with 5 ms pause in between
size_t sendUBX(uint8_t* msg, uint8_t len) {
  size_t written = 0;
  for(int i = 0; i < len; i++) {                        
    written += ss.write(msg[i]);
    delay(5); // simulating a 38400baud pace (or less), otherwise commands are not accepted by the device.
  }
  return written;
}  

void addChecksum(uint8_t* msg, uint8_t len) {
  uint8_t ckA = 0, ckB = 0;
  for (uint8_t i = 2; i < len - 2; i++) {
    ckA += msg[i];
    ckB += ckA;
  }
  msg[len - 2] = ckA;
  msg[len - 1] = ckB;
}

/*****************************************************************************! 
  @brief  configure GPS messages
  @details via binary UBX statement
  @details disable all NMEA messages, tehen re-enable the required ones. Disable UBX messages
  @return void
*****************************************************************************/
// these data are taken from Ublox U-Center (incl. checksums)
const char UBLOX_MSG_INIT[] PROGMEM = {
  // Disable NMEA
  0xB5,0x62,0x06,0x01,0x08,0x00,0xF0,0x00,0x00,0x00,0x00,0x00,0x00,0x01,0x00,0x24, // GxGGA off
  0xB5,0x62,0x06,0x01,0x08,0x00,0xF0,0x01,0x00,0x00,0x00,0x00,0x00,0x01,0x01,0x2B, // GxGLL off
  0xB5,0x62,0x06,0x01,0x08,0x00,0xF0,0x02,0x00,0x00,0x00,0x00,0x00,0x01,0x02,0x32, // GxGSA off
  0xB5,0x62,0x06,0x01,0x08,0x00,0xF0,0x03,0x00,0x00,0x00,0x00,0x00,0x01,0x03,0x39, // GxGSV off
  0xB5,0x62,0x06,0x01,0x08,0x00,0xF0,0x04,0x00,0x00,0x00,0x00,0x00,0x01,0x04,0x40, // GxRMC off
  0xB5,0x62,0x06,0x01,0x08,0x00,0xF0,0x05,0x00,0x00,0x00,0x00,0x00,0x01,0x05,0x47, // GxVTG off

  // enable NMEA, which ever is activated (gotten from Message monitor in Ublox U-Center)
  0xB5,0x62,0x06,0x01,0x08,0x00,0xF0,0x00,0x00,0x01,0x00,0x00,0x00,0x00,0x00,0x28,  // GGA on, on UART1
  0xB5,0x62,0x06,0x01,0x08,0x00,0xF0,0x01,0x00,0x01,0x00,0x00,0x00,0x00,0x01,0x2F,  // GLL on, on UART1   
  //0xB5,0x62,0x06,0x01,0x08,0x00,0xF0,0x02,0x00,0x01,0x00,0x00,0x00,0x00,0x02,0x36,  // GSA on, on UART1   
  //0xB5,0x62,0x06,0x01,0x08,0x00,0xF0,0x03,0x00,0x01,0x00,0x00,0x00,0x00,0x03,0x3D,  // GSV on, on UART1    
  0xB5,0x62,0x06,0x01,0x08,0x00,0xF0,0x04,0x00,0x01,0x00,0x00,0x00,0x00,0x04,0x44,  // RMC on, on UART1   
  //0xB5,0x62,0x06,0x01,0x08,0x00,0xF0,0x05,0x00,0x01,0x00,0x00,0x00,0x00,0x05,0x4B,  // VTG on, on UART1   

  // Disable UBX
  0xB5,0x62,0x06,0x01,0x08,0x00,0x01,0x07,0x00,0x00,0x00,0x00,0x00,0x00,0x17,0xDC, //NAV-PVT off
  0xB5,0x62,0x06,0x01,0x08,0x00,0x01,0x02,0x00,0x00,0x00,0x00,0x00,0x00,0x12,0xB9, //NAV-POSLLH off
  0xB5,0x62,0x06,0x01,0x08,0x00,0x01,0x03,0x00,0x00,0x00,0x00,0x00,0x00,0x13,0xC0, //NAV-STATUS off

  // Enable UBX
  //0xB5,0x62,0x06,0x01,0x08,0x00,0x01,0x07,0x00,0x01,0x00,0x00,0x00,0x00,0x18,0xE1, //NAV-PVT on
  //0xB5,0x62,0x06,0x01,0x08,0x00,0x01,0x02,0x00,0x01,0x00,0x00,0x00,0x00,0x13,0xBE, //NAV-POSLLH on
  //0xB5,0x62,0x06,0x01,0x08,0x00,0x01,0x03,0x00,0x01,0x00,0x00,0x00,0x00,0x14,0xC5, //NAV-STATUS on

  // Rate
  //0xB5,0x62,0x06,0x08,0x06,0x00,0x64,0x00,0x01,0x00,0x01,0x00,0x7A,0x12, //(10Hz)
  //0xB5,0x62,0x06,0x08,0x06,0x00,0xC8,0x00,0x01,0x00,0x01,0x00,0xDE,0x6A, //(5Hz)
  //0xB5,0x62,0x06,0x08,0x06,0x00,0xE8,0x03,0x01,0x00,0x01,0x00,0x01,0x39, //(1Hz)
};

void configureGpsMessages(){
  sprintf(outstring,"configureGPSMessages");
  logOut(2,outstring);
  // send configuration data in UBX protocol
  for(int i = 0; i < sizeof(UBLOX_MSG_INIT); i++) {                        
    ss.write( pgm_read_byte(UBLOX_MSG_INIT+i) );
    delay(5); // simulating a 38400baud pace (or less), otherwise commands are not accepted by the device.
  }
}  

/*****************************************************************************! 
  @brief  configure GPS for "pedestrian" mode (default) - data from UKHAS files
  @details via binary UBX statement
  @return void
*****************************************************************************/
// CFG-NAV5 (0x06 0x24): Get/Set Navigation Engine Settings
const char UBLOX_MODE_PEDESTRIAN[] PROGMEM = { // Pedestrian mode, high accuracy at slow speed
0xB5,0x62,0x06,0x24,0x24,0x00,0xFF,0xFF,0x03,0x03,0x00,0x00,0x00,0x00,0x10,0x27,0x00,0x00,0x05,0x00,0xFA,0x00,0xFA,0x00,0x64,0x00,0x2C,
0x01,0x00,0x00,0x00,0x00,0x10,0x27,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x4A,0x75 
};

// configure GPS for "pedestrian" mode: optimized accuracy for slow speeds
void configurePedestrian(){
  delay(100);
  logOut(2,(char*)"configure UKHAS 'Pedestrian' Mode");
  // send configuration data in UBX protocol
  for(int i = 0; i < sizeof(UBLOX_MODE_PEDESTRIAN); i++) {                        
    ss.write( pgm_read_byte(UBLOX_MODE_PEDESTRIAN + i) );
    delay(5); // simulating a 38400baud pace (or less), otherwise commands are not accepted by the device.
  }
} 

/*****************************************************************************! 
  @brief  configure GPS for "portable" mode (default) - data from UKHAS files
  @details via binary UBX statement
  @return void
*****************************************************************************/
const char UBLOX_MODE_PORTABLE[] PROGMEM = { // Portable mode, default
0xB5,0x62,0x06,0x24,0x24,0x00,0xFF,0xFF,0x00,0x03,0x00,0x00,0x00,0x00,0x10,0x27,0x00,0x00,0x05,0x00,0xFA,0x00,0xFA,0x00,0x64,0x00,0x2C,
0x01,0x00,0x00,0x00,0x00,0x10,0x27,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x47,0x0F 
};

void configurePortable(){
  delay(100);
  logOut(2,(char*)"configure UKHAS 'Portable' Mode");
  // send configuration data in UBX protocol
  for(int i = 0; i < sizeof(UBLOX_MODE_PORTABLE); i++) {                        
    ss.write( pgm_read_byte(UBLOX_MODE_PORTABLE + i) );
    delay(5); // simulating a 38400baud pace (or less), otherwise commands are not accepted by the device.
  }
} 

/*****************************************************************************! 
  @brief  set power saving mode - data from UKHAS files
  @details via binary UBX statement
  @return void
*****************************************************************************/
//UKHAS Wiki: Set GPS ot Power Save Mode (Default Cyclic 1s)
// CFG-RXM (0x06 0x11) : Here the GPS ist set to power save mode (0x01)
uint8_t setUKhasPSM[] = { 0xB5, 0x62, 0x06, 0x11, 0x02, 0x00, 0x08, 0x01, 0x22, 0x92 };
// CFG-RXM (0x06 0x11) : Here the GPS ist set to continuous mode (0x00)
uint8_t setUKhasCoM[] = { 0xB5, 0x62, 0x06, 0x11, 0x02, 0x00, 0x08, 0x00, 0x21, 0x91};  

void configureUKhasPSM(){ // power saving mode
  delay(100);
  logOut(2,(char*)"configure UKHAS 'Power Saving' Mode");
  // send configuration data in UBX protocol
  for(int i = 0; i < sizeof(setUKhasPSM); i++) {                        
    ss.write( pgm_read_byte(setUKhasPSM + i) );
    delay(5); // simulating a 38400baud pace (or less), otherwise commands are not accepted by the device.
  }
} 

void configureUKhasCoM(){ // continuous mode
  delay(100);
  logOut(2,(char*)"configure UKHAS 'Power Saving' Mode");
  // send configuration data in UBX protocol
  for(int i = 0; i < sizeof(setUKhasCoM); i++) {                        
    ss.write( pgm_read_byte(setUKhasCoM + i) );
    delay(5); // simulating a 38400baud pace (or less), otherwise commands are not accepted by the device.
  }
} 

