88markus88/ESP32_Anchor_Alarm/src/ePaperAnchorAlarm.cpp
/*****************************************************************************! 
  @brief  set power saving mode PM2 for 30 sec or 1 sec update
  @details via binary UBX statement
  @details 30 sec to save power, 1 sec for normal fast operation
  @return void
*****************************************************************************/

//// CFG-PM2 (0x06 0x3B) - extended Power Management configuration
//const char UBLOX_PM2_30SEC[] PROGMEM = { // configure power management to 30000 ms updatePeriod. old, possibly wrong
//  // searchPeriod: 30000 ms minAquTime: 0 ms onTime: 2000 ms
//0xB5,0x62,0x06,0x3B,0x2C,0x00,0x01,0x06,0x00,0x00,0x0E,0x90,0x42,0x01,0xE8,0x03,0x00,0x00,0x10,0x27,0x00,0x00,0x00,0x00,0x00,0x00,0x02,
//0x00,0x00,0x00,0x2C,0x01,0x00,0x00,0x4F,0xC1,0x03,0x00,0x87,0x02,0x00,0x00,0xFF,0x00,0x00,0x00,0x64,0x40,0x01,0x00,0xE6,0xAE
//};
//
//const char UBLOX_PM2_1SEC[] PROGMEM = { // configure power management to 1000 ms updatePeriod, possibly wrong
//  // searchPeriod: 1000 ms minAquTime: 0 ms onTime: 2000 ms
//0xB5,0x62,0x06,0x3B,0x2C,0x00,0x01,0x06,0x00,0x00,0x0E,0x90,0x42,0x01,0xE8,0x03,0x00,0x00,0x10,0x27,0x00,0x00,0x00,0x00,0x00,0x00,0x02,
//0x00,0x00,0x00,0x2C,0x01,0x00,0x00,0x4F,0xC1,0x03,0x00,0x87,0x02,0x00,0x00,0xFF,0x00,0x00,0x00,0x64,0x40,0x01,0x00,0xE6,0xAE   
//};

const char UBLOX_PM2_1SEC[] PROGMEM = { // configure power management to 1000 ms updatePeriod. from U-Center 15.2.26
// 1000 ms update period (E8 03), 10 sec search period, 0 minAcqTime, 0 On Time
0xB5,0x62,0x06,0x3B,0x2C,0x00,0x01,0x06,0x00,0x00,0x0E,0x10,0x42,0x01,0xE8,0x03,0x00,0x00,0x10,0x27,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x2C,0x01,0x00,0x00,0x4F,0xC1,0x03,0x00,0x86,0x02,0x00,0x00,0xFE,0x00,0x00,0x00,0x64,0x40,0x01,0x00,0x62,0xEA 
};

// CFG-PM2 (0x06 0x3B) - extended Power Management configuration
const char UBLOX_PM2_10SEC[] PROGMEM = { // configure power management to 10000 ms updatePeriod. from U-Center 15.2.26
// 10000 ms update period (10 27), 10 sec search period, 0 minAcqTime, 0 On Time
0xB5,0x62,0x06,0x3B,0x2C,0x00,0x01,0x06,0x00,0x00,0x0E,0x10,0x42,0x01,0x10,0x27,0x00,0x00,0x10,0x27,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x2C,0x01,0x00,0x00,0x4F,0xC1,0x03,0x00,0x86,0x02,0x00,0x00,0xFE,0x00,0x00,0x00,0x64,0x40,0x01,0x00,0xAE,0x76
};

void configurePM2Slow(){
  // send configuration data in UBX protocol
  sprintf(outstring,"configurePM2Slow");
  logOut(2,outstring);
  for(int i = 0; i < sizeof(UBLOX_PM2_10SEC); i++) {                        
    ss.write( pgm_read_byte(UBLOX_PM2_10SEC + i) );
    delay(5); // simulating a 38400baud pace (or less), otherwise commands are not accepted by the device.
  }
} 

void configurePM2Fast(){
  // send configuration data in UBX protocol
  sprintf(outstring,"configurePM2Fast");
  logOut(2,outstring);
  for(int i = 0; i < sizeof(UBLOX_PM2_1SEC); i++) {                        
    ss.write( pgm_read_byte(UBLOX_PM2_1SEC + i) );
    delay(5); // simulating a 38400baud pace (or less), otherwise commands are not accepted by the device.
  }
} 

// UKHAS Wiki: Switch the RF GPS section off, draws about 5mA, retains its settings, 
//             wakes on serial command.
// CFG-RST (0x06 0x04) Reset Receiver / Clear Backup Data Structures
// 0x08: controlled gps stop. 
// The receiver will not be restarted, but will stop any GPS related processing
uint8_t GPSoff[] = {0xB5, 0x62, 0x06, 0x04, 0x04, 0x00, 0x00, 0x00,0x08, 0x00, 0x16, 0x74};

// 0x09: controlled gps start
uint8_t GPSon[] =  {0xB5, 0x62, 0x06, 0x04, 0x04, 0x00, 0x00, 0x00,0x09, 0x00, 0x17, 0x76};

// Abschalten des HF Teils und und der Messages vom GPS.
// TinyGPS zeigt immer noch die jeweils letzten Daten als valide an. 
void configureUKhasGPSoff(){
  // send configuration data in UBX protocol
  sprintf(outstring,"configureUKhasGPSoff");
  logOut(2,outstring);
  for(int i = 0; i < sizeof(GPSoff); i++) {                        
    ss.write( pgm_read_byte(GPSoff + i) );
    delay(5); // simulating a 38400baud pace (or less), otherwise commands are not accepted by the device.
  }
} 

// Wieder einschalten des HF Teils und der Messages des GPS. Funktioniert, braucht aber ein par sec bis wieder valide Daten kommen
void configureUKhasGPSon(){
  sprintf(outstring,"configureUKhasGPSon");
  logOut(2,outstring);  
  // send configuration data in UBX protocol
  for(int i = 0; i < sizeof(GPSon); i++) {                        
    ss.write( pgm_read_byte(GPSon + i) );
    delay(5); // simulating a 38400baud pace (or less), otherwise commands are not accepted by the device.
  }
} 

//---------------- Power save configuration as proposed in Ublox application note 
//---------------- Power Management Considerations for u-blox 7 and M8 GNSS receivers
// Three Steps:
// 1. UBX-CFG GNSS configuration to disable Glonass, Galileo, Beidou (M8N can do power save only with GPS)
// 2. UBX-CFG PM2  configuration to set desired PM Mode: on/ off or cyclic mode (we are using cyclic)
// 3. UBX-CFG RXM  configuration to set power mode to "1 - Power Save Mode"

const char UBLOX_GNSS_ONLY_GPS[] PROGMEM = { // configure CFG - GNSS to GPS satellites only
0xB5,0x62,0x06,0x3E,0x3C,0x00,0x00,0x00,0x16,0x07,0x00,0x08,0xFF,0x00,0x01,0x00,0x00,
0x01,0x01,0x00,0x03,0x00,0x01,0x00,0x00,0x01,0x02,0x00,0x00,0x00,0x00,0x00,0x00,0x01,
0x03,0x00,0x00,0x00,0x00,0x00,0x00,0x01,0x04,0x00,0x00,0x00,0x00,0x00,0x00,0x01,0x05,
0x00,0x03,0x00,0x00,0x00,0x00,0x01,0x06,0x00,0x00,0x00,0x00,0x00,0x00,0x01,0xC8,0xDA
};

const char UBLOX_GNSS_PM2_CYCLIC[] PROGMEM = { // configure CFG-PM2 - cyclic, updatePerios 10000ms, searchPeriod 10s, minAquTime 0, OnTime 2s
0xB5,0x62,0x06,0x3B,0x2C,0x00,0x01,0x06,0x00,0x00,0x0E,0x90,0x42,0x01,0x10,0x27,0x00,
0x00,0x10,0x27,0x00,0x00,0x00,0x00,0x00,0x00,0x02,0x00,0x00,0x00,0x2C,0x01,0x00,0x00,
0x4F,0xC1,0x03,0x00,0x87,0x02,0x00,0x00,0xFF,0x00,0x00,0x00,0x64,0x40,0x01,0x00,0x32,
0x3A
};  

const char UBLOX_GNSS_RXM[] PROGMEM = { // configure CFG - GNSS to GPS satellites only
0xB5,0x62,0x06,0x11,0x02,0x00,0x08,0x01,0x22,0x92   
};

