88markus88/ESP32_Anchor_Alarm/src/ePaperAnchorAlarm.cpp
// configure power save as described in Ublox application note
void configurePowerSaveAppNote()
{
  sprintf(outstring,"configurePowerSaveAppNote");
  logOut(2,outstring); 
  // send configuration data in UBX protocol: Only GPS active, not Glonass, Beidou, Galileo
  //for(int i = 0; i < sizeof(UBLOX_GNSS_ONLY_GPS); i++) {                        
  //  ss.write( pgm_read_byte(UBLOX_GNSS_ONLY_GPS + i) );
  //  delay(5); // simulating a 38400baud pace (or less), otherwise commands are not accepted by the device.
  //}
  smartDelay(50);
  // send configuration data in UBX protocol: configure PM2 to cyclic
  for(int i = 0; i < sizeof(UBLOX_GNSS_PM2_CYCLIC); i++) {                        
    ss.write( pgm_read_byte(UBLOX_GNSS_PM2_CYCLIC + i) );
    delay(5); // simulating a 38400baud pace (or less), otherwise commands are not accepted by the device.
  }  
  smartDelay(50);
  // send configuration data in UBX protocol: configure RXM to power save mode
  for(int i = 0; i < sizeof(UBLOX_GNSS_RXM); i++) {                        
    ss.write( pgm_read_byte(UBLOX_GNSS_RXM + i) );
    delay(5); // simulating a 38400baud pace (or less), otherwise commands are not accepted by the device.
  }  
}

// Revert to last saved configuration (CFG-CFG)
const char UBLOX_REVERT_SAVED[] PROGMEM = {
0xB5,0x62,0x06,0x09,0x0D,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0x00,0x00,0x01,0x1B,0xB1
};

void revertUbloxToLastSavedConfig()
{
  sprintf(outstring,"revertUbloxToLastSavedConfig");
  logOut(2,outstring); 
  for(int i = 0; i < sizeof(UBLOX_REVERT_SAVED); i++) {                        
    ss.write( pgm_read_byte(UBLOX_REVERT_SAVED + i) );
    delay(5); // simulating a 38400baud pace (or less), otherwise commands are not accepted by the device.
  }  
  smartDelay(50);
}

// Revert to default configuration (CFG-CFG)
const char UBLOX_REVERT_DEFAULT[] PROGMEM = {
0xB5,0x62,0x06,0x09,0x0D,0x00,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0x00,0x00,0x01,0x19,0x98  
};

void revertUbloxToDefaultConfig()
{
  sprintf(outstring,"revertUbloxToDefaultConfig");
  logOut(2,outstring); 
  for(int i = 0; i < sizeof(UBLOX_REVERT_SAVED); i++) {                        
    ss.write( pgm_read_byte(UBLOX_REVERT_SAVED + i) );
    delay(5); // simulating a 38400baud pace (or less), otherwise commands are not accepted by the device.
  }  
  smartDelay(50);
}

/*****************************************************************************! 
  @brief  resetPowerSaveMode() : reset all power save stuff to a neutral status
  @details 
  @return void
*****************************************************************************/
void resetPowerSaveMode(){
  sprintf(outstring,"resetPowerSaveMode");
  logOut(2,outstring);

  #if defined NEO_6M || defined NEO_M8N
    /*
    logOut(2,(char *)"resetPowerSaveMode: cont. mode, PM2 to fast, GPS HF to ON");
    // UKHAS power save mode -> continuous mode
    configureUKhasCoM();
  
    // PM2
    configurePM2Fast();
  
    // switch on GPS HF electronics
    configureUKhasGPSon(); 
    */
   
    //revertUbloxToLastSavedConfig(); // revert Ublox GPS to last saved configuration
    revertUbloxToDefaultConfig(); // revert Ublox to default configuration
  #endif
}

/*****************************************************************************! 
  @brief  configurePowerSaveMode
  @details 
  @param  bool switchON. true:  switch all power stuff for ESP32 running
  @param                 false: switch power stuff for ESP32 deep sleep
  @return void
*****************************************************************************/
void configurePowerSaveMode(bool switchON)
{
  sprintf(outstring,"configurePowerSaveMode to %d",wData.PowerSaveMode);
  logOut(2,outstring);
  if(switchON){  
    #ifdef NEO_6M
      if((wData.PowerSaveMode == MIN) ||(wData.PowerSaveMode == MID)||(wData.PowerSaveMode == MAX)){
        // remove unnecessary NMEA messages to optimize GPS performance
        smartDelay(50); // give GPS some time to start up
        configureGpsMessages(); // working from gpsTest
        sprintf(wData.actConfigString,"%s2.configGPSMsg\n", wData.actConfigString);
        wData.linesInConfigString++;

        // configure GPS for "pedestrian" mode: good accuracy at slow speeds
        smartDelay(50); // give GPS some time to start up
        configurePedestrian();
        sprintf(wData.actConfigString,"%sconfigPedestrian\n", wData.actConfigString);
        wData.linesInConfigString++;
      }

      if(wData.PowerSaveMode == MID){
        // set power saving mode
        smartDelay(500); // give GPS some time to start up
        configureUKhasPSM();
        sprintf(wData.actConfigString,"%sconfigUKhasPSM\n", wData.actConfigString);
        wData.linesInConfigString++;
      } 

      if(wData.PowerSaveMode == MAX){
        configurePM2Fast();
        sprintf(wData.actConfigString,"%sconfigGPSOn\n", wData.actConfigString);
        wData.linesInConfigString++;
        smartDelay(2000); // give GPS some time to start up
      }  
    #endif

    #ifdef NEO_M8N 
      if((wData.PowerSaveMode == MIN) ||(wData.PowerSaveMode == MID)||(wData.PowerSaveMode == MAX)){
        // remove unnecessary NMEA messages to optimize GPS performance
        smartDelay(50); // give GPS some time to start up
        configureGpsMessages(); // working from gpsTest
        sprintf(wData.actConfigString,"%sconfigGPSMsg\n", wData.actConfigString);
        wData.linesInConfigString++;
        smartDelay(50); // give GPS some time to start up
        configurePedestrian();
        sprintf(wData.actConfigString,"%sconfigPedestrian\n", wData.actConfigString);
        wData.linesInConfigString++;
      }  

      if(wData.PowerSaveMode == MID){
        // set power saving mode      
        //configurePM2Fast; 
        // sprintf(wData.actConfigString,"%sConfigPM2Fast\n", wData.actConfigString);
        // wData.linesInConfigString++;
        configurePowerSaveAppNote(); //!!! switches off all satellites other than GPS!
        sprintf(wData.actConfigString,"%sConfigAppNote\n", wData.actConfigString);
        wData.linesInConfigString++;
        smartDelay(50); // give GPS some time to start up
      }  

