88markus88/ESP32_Anchor_Alarm/src/ePaperAnchorAlarm.cpp
      if(wData.PowerSaveMode == MAX){
        configureUKhasGPSon(); // switch on GPS HF electronics
        sprintf(wData.actConfigString,"%sconfigGPSOn\n", wData.actConfigString);
        wData.linesInConfigString++;
        smartDelay(100); // give GPS some time to start up
        // then check if reception re-estabilshed. alert if not.
        boolean ret = gpsReEstablished(wData.noGpsAlertThreshold);
        if(!ret){
          wData.validGPSLocation = false;  
          wData.alertON = true;
          wData.alertReason += 8;
          strcat(wData.alertReasonString,"Invalid GPS Loc.  ");
        }
        smartDelay(500); // give GPS some time to stabilize data
      }  
    #endif

    #ifdef ATGM336H // to be used for chinese ATGM336H module
      if((wData.PowerSaveMode == MIN) ||(wData.PowerSaveMode == MID)||(wData.PowerSaveMode == MAX)){
        //NMEA sentences off other than GGA; gll; rmc
        char pcas03[] = "$PCAS03,1,1,0,0,1,0,0,0,0,0,,,0,0*03\r\n";	/* NMEA command, write(fd, cmdbuf, strlen(cmdbuf)); */
        ss.write(pcas03, strlen(pcas03));
        //turn on GPS, Beidou, Glonass
        char pcas04[] = "$PCAS04,7*1E\r\n";	/* NMEA command, write(fd, cmdbuf, strlen(cmdbuf)); */
        ss.write(pcas04, strlen(pcas04));
        // dynamic model: pedestrian
        char pcas11[] = "$PCAS11,2*1F\r\n";	/* NMEA command, write(fd, cmdbuf, strlen(cmdbuf)); */
        ss.write(pcas11, strlen(pcas11));
      }
    #endif   
  }
  else{ // switch off 
    #ifdef NEO_M8N
      if(wData.PowerSaveMode == MID){
        configurePM2Slow();
        delay(50); // wait a bit for gps to adapt to new settings
      }

      if(wData.PowerSaveMode == MAX){
        configureUKhasGPSoff();
        smartDelay(100); // give GPS some time to process
        }
    #endif 

    #ifdef NEO_6M
       if(wData.PowerSaveMode == MAX){
        configurePM2Slow();
        delay(50); // wait a bit for gps to adapt to new settings
      }
    #endif

    #ifdef ATGM336H // to be used for chinese ATGM336H module
      if((wData.PowerSaveMode == MID)||(wData.PowerSaveMode == MAX)){
        // receiver standby mode
        //char cmdbuf[] = "$PCAS12,10*2F\r\n";	// for 10 seconds
        //char cmdbuf[] = "$PCAS12,8*16\r\n";	  // for 8 seconds
        char cmdbuf[] = "$PCAS12,18*27\r\n";	// for 18 seconds
        //char cmdbuf[] = "$PCAS12,20*2C\r\n";	// for 20 seconds
        //char cmdbuf[] = "$PCAS12,28*24\r\n";	// for 28 seconds
        ss.write(cmdbuf, strlen(cmdbuf));
      }
    #endif 
  }  
}

/*****************************************************************************! 
  @brief  startupGPSSafely()
  @details checks if we have a fix, if not tries to re-establish
  @details if that does not work within first time, reduce powerSaveMode to MIN and try again
  @details if that does not work: message and return
  @param uint32_t  secs1: first waiting time for GPS fix until reduction of power save mode
  @param uint32_t  secs2: second waiting time for GPS fix after reduction of power save mode
  @return true if started properly, false if not.
*****************************************************************************/
bool startupGPSSafely(uint32_t  secs1, uint32_t secs2){
    sprintf(outstring,"************ startupGPSSafely: started");
    logOut(2, outstring);  
  if(gpsReEstablished(secs1)){
    sprintf(outstring,"startupGPSSafely: GPS Fix OK");
    logOut(2, outstring);
    //showWelcomeMessage(false,outstring, 1);
    return true;
  }
  else{ // gps fix not re-established within time1 secs
    sprintf(outstring,"-------- startupGPSSafely: NO Fix within %ld seconds. Retry.", secs1);
    logOut(2, outstring);  
    if(wData.PowerSaveMode > MIN){
      wData.PowerSaveMode = MIN;
      // wData.preferencesChanged = true; // ensures that new power save mode is written to preferences
      resetPowerSaveMode();
      smartDelay(500);
      configurePowerSaveMode(true);
      if(gpsReEstablished(secs2)){
        sprintf(outstring,"startupGPSSafely: GPS Fix OK after reducing powerSaveMode to MIN");
        logOut(2, outstring);
        //showWelcomeMessage(false,outstring, 1);
        return true;
      }
      else{
        sprintf(outstring,"startupGPSSafely: GPS Fix NOT OK after reducing powerSaveMode to MIN");
        logOut(2, outstring);
        showWelcomeMessage(true,(char*)"GPS Fix NOT OK\nafter powerSave\nset to MIN", 1);
        smartDelay(1000);
        return false;
      }  
    }
    else{
      if(gpsReEstablished(secs2)){
        sprintf(outstring,"startupGPSSafely: GPS Fix already in PowerSaveMode MIN. OK after retry");
        logOut(2, outstring);
        //showWelcomeMessage(false,outstring, 1);
        return true;
      }
      else{
        sprintf(outstring,"startupGPSSafely: GPS Fix already in PowerSaveMode MIN. NOT OK after retry");
        logOut(2, outstring);
        //showWelcomeMessage(false,outstring, 1);
        return false;
      }
    }

  }  
  return true;
}

// test function for welcome messages on ePaper
void testWelcomeMessages()
{
  char show[100];
  sprintf(show,"AnchorAlarm %s", VERSION);
  showWelcomeMessage(true, show, 1);
  sprintf(outstring,"testWelcomeMessage: _%s_", show);
  logOut(2, outstring);
  buzzer(1, 100,10);
  smartDelay(1000);

  sprintf(show,"12345678901234");
  showWelcomeMessage(false, show, 1);
  sprintf(outstring,"testWelcomeMessage: _%s_", show);
  logOut(2, outstring);
  smartDelay(1000);
  sprintf(show,"GPS Fix OK");
  showWelcomeMessage(false, show, 1);
  sprintf(outstring,"testWelcomeMessage: _%s_", show);
  logOut(2, outstring);
  smartDelay(1000);
  sprintf(show,"No GPS Fix");
  showWelcomeMessage(false, show, 1);
  sprintf(outstring,"testWelcomeMessage: _%s_", show);
  logOut(2, outstring);
  smartDelay(1000);
  sprintf(show,"abcdefghijklmn\ntest123\nline3");
  showWelcomeMessage(false, show, 3); 
  sprintf(outstring,"testWelcomeMessage: _%s_", show);
  logOut(2, outstring);
  smartDelay(3000);
}

/*****************************************************************************! 
  @brief  setup routine
  @details 
  @return void
*****************************************************************************/
void setup()
{
  uint32_t cpu_freq_mhz;
  char show[30];

