88markus88/ESP32_Anchor_Alarm/src/ePaperAnchorAlarm.cpp
  startTimeMillis = millis(); // remember time when woken up
  Serial.begin(115200);       // set speed for serial monitor

  logOut(2,(char*)"**********************************************************");
  sprintf(outstring,"* %s %s - %s ",PROGNAME, VERSION, BUILD_DATE);
  logOut(2,outstring);
  logOut(2,(char*)"**********************************************************");

  //sprintf(show,"AnchorAlarm %s", VERSION);
  //showWelcomeMessage(true, show, 1);
  //buzzer(1, 100,10);

  uint32_t size_wData = sizeof(wData);
  sprintf(outstring,"Size of wData: %d bytes. Remaining RTC Memory: %d bytes", size_wData, 4096-size_wData); 
  logOut(2,outstring);
  sprintf(outstring,"Power Save Mode %d ", wData.PowerSaveMode); 
  logOut(2,outstring);

  sprintf(wData.actConfigString,"free RTC: %d\n", 4096-size_wData);   // also pre-sets wData.actConfigString and deletes old content
  wData.linesInConfigString = 1;

  // get and re-set CPU clock speed
  // https://deepbluembedded.com/esp32-change-cpu-speed-clock-frequency/
  uint32_t CPUFreq = getCpuFrequencyMhz();
  uint32_t XTALFreq = getXtalFrequencyMhz();
  uint32_t ABPFreq = getApbFrequency();
  delay(50);
  sprintf(outstring,"Orig.Frequencies: CPU: %ld MHz XTAL: %ld MHz ABP: %ld Hz", CPUFreq, XTALFreq, ABPFreq);
  logOut(2,outstring);

  //function takes the following frequencies as valid values:
  //  240, 160, 80    <<< For all XTAL types
  //  40, 20, 10      <<< For 40MHz XTAL
  //  26, 13          <<< For 26MHz XTAL
  //  24, 12          <<< For 24MHz XTAL

  #if defined NEO_M8N || defined NEO_6M || defined ATGM336H
    if((wData.PowerSaveMode == MIN) ||(wData.PowerSaveMode == MID)||(wData.PowerSaveMode == MAX)){
      cpu_freq_mhz = 80;
      setCpuFrequencyMhz(cpu_freq_mhz);
    }
  #endif
  
  CPUFreq = getCpuFrequencyMhz();
  XTALFreq = getXtalFrequencyMhz();
  ABPFreq = getApbFrequency();
  
  sprintf(outstring,"New Frequencies: CPU: %ld MHz XTAL: %ld MHz ABP: %ld Hz", CPUFreq, XTALFreq, ABPFreq);
  logOut(2,outstring);
  sprintf(wData.actConfigString,"%sCPU: %ld MHz\n", wData.actConfigString, cpu_freq_mhz);
  wData.linesInConfigString++;


  //#ifdef READ_PREFERENCES
  //  // get data from EEPROM using preferences library in readonly mode
  //  sprintf(outstring," before readPreferences()");
  //  logOut(2,outstring);
  //  readPreferences();
  //#endif

  // increment start counter
  wData.startCounter++;

   // initialize rotary encoder
   ESP32Encoder::useInternalWeakPullResistors = puType::up;
   encoder.attachHalfQuad(ENCODER_CLK_PIN, ENCODER_DT_PIN);
   encoder.setCount(0);

  // button via interrupt
  pinMode(ENCODER_SW_PIN, INPUT_PULLUP);
  attachInterrupt(
    digitalPinToInterrupt(ENCODER_SW_PIN),
    handleButtonInterrupt,
    FALLING
  );

  // initialize the display
  logOut(2,(char*)"before initDisplay()");
  initDisplay(wData.startCounter, FULL_UPDATE_INTERVAL); 

  // test for welcome messages on ePaper. Must be after initialization of display.
  if(testWelcomeMessage){
    buzzer(1, 100,10);
    testWelcomeMessages();
  }

  // Serial port for GPS module
  ss.begin(9600, SERIAL_8N1, RXPin, TXPin); // RX, TX
  gpsTimerHandle = gpsTimer.setInterval(200L, gpsHandler); // set gps test timer to 100 milliseconds

  if(wData.currentMode == MODE_STARTED){ // tests only with fresh start, to prevent this stuff when waking up after sleep
    // show welcome message on ePaper
    sprintf(show,"AnchorAlarm %s", VERSION);
    showWelcomeMessage(true, show, 1);

    #ifdef READ_PREFERENCES
      // get data from EEPROM using preferences library in readonly mode
      sprintf(outstring," before readPreferences()");
      logOut(2,outstring);
      readPreferences();
    #endif

    // configure GPS for startup
    configurePowerSaveMode(true);
    showWelcomeMessage(false,wData.actConfigString, wData.linesInConfigString);

    // check GPS. If no fix: check if powerSaveMode is > MIN (MID or MAX) => set to MIN and try some more
    sprintf(show,"startupGPS safely");
    showWelcomeMessage(false, show, 1);
    if(startupGPSSafely(120, 60)){
      sprintf(outstring,"setup: GPS Fix OK");
      logOut(2, outstring);
    }
    else{
      sprintf(outstring,"setup: GPS Fix NOT OK");
      logOut(2, outstring);
      buzzer(2, 200,100);
    }

    // short display test
    if(testDisplayModule)
      testDisplay();  

    showWelcomeMessage(false, (char*)"Buzzer Test" ,1);

    if(testBuzzer)        // buzzer test
      //buzzer(1,100,500); 
      doParallelBuzzer(1,100,500);
    if(testDisplayModule) // display test, original from WeAct (manufacturer of the ePaper display)
      testDisplayWeAct();
    if(testBuzzer){       // buzzer test
      logOut(2,(char*)"Testing buzzer");
      for(int i=0; i<5; i++)
      {
         //buzzer(1,100,500-i*75); // buzzer test
         doParallelBuzzer(1,100,500);
         delay(1000); // needed for parallel buzzer
      } 
    }  

    boolean buttonPressed = false; 
    int64_t encoderPos = 0;
    if(testRotaryEncoder){
      showWelcomeMessage(false, (char*)"Encoder Test",1);
      for(int i=0;i<30;i++) {
        testRotary(&buttonPressed, &encoderPos );
        delay(500);
      }  
    }  

    if(testGPSModule){
      showWelcomeMessage(false, (char*)"GPS Test",1);
      logOut(2,(char*)"GPS serial started.");
      getGPSStartPosition(&startLat, &startLon); // get start position from GPS

      gps_offset(
        startLat,
        startLon,
        anchorDistance_m,
        anchorBearing_deg,
        &anchorLat,
        &anchorLon
      );
      Serial.print(F("Calculated anchor position: "));
      Serial.print(anchorLat, 6); 
      Serial.print(F(", "));
      Serial.println(anchorLon, 6);
    }
  }  // if MODE_STARTED
  else{ // all other modes
    // ensure that GPS ist started correctly. specifically in MAX: it has to be switched on
    configurePowerSaveMode(true); // true: switch on
    // check GPS. If no fix: check if powerSaveMode is > MIN (MID or MAX) => set to MIN and try some more
    if(startupGPSSafely(120, 60)){
      sprintf(outstring,"setup: GPS Fix OK");
      logOut(2, outstring);
    }
    else{
      sprintf(outstring,"setup: GPS Fix NOT OK");
      logOut(2, outstring);
      sprintf(show,"!!No GPS Fix!!");
      showWelcomeMessage(false, show, 1);
      buzzer(2, 200,100);
      smartDelay(1000);
    }
  }

} // setup

